app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Differential Equations"], ["room_number", 104], ["created_at", "2020-08-06 20:39:45.208334"], ["updated_at", "2020-08-06 20:39:45.208334"]]
---
    def create
        @class = SchoolClass.create(class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 305], ["updated_at", "2020-08-06 21:01:28.627500"], ["id", 1]]
---
    def update
        @class = SchoolClass.find(params[:id])
        @class.update(class_params)